In [1]:
import numpy as np
np.random.randn(5,4)

array([[-2.29189227, -1.15806891,  0.35285249,  0.7315475 ],
       [-1.2023509 ,  0.85720003, -0.46757644,  1.04261888],
       [-1.64466487,  2.44705094,  1.72735501,  0.01107781],
       [-0.62530752,  1.11337532,  0.4370016 , -0.14604809],
       [ 0.65922732,  0.78581824, -0.12999473, -2.30292726]])

In [3]:
import pandas as pd
df=pd.DataFrame(np.random.rand(5,3),['A','B','C','D','E'],[1,2,3])

In [8]:
df

          1         2         3
A  0.260636  0.658642  0.533796
B  0.687484  0.609643  0.107964
C  0.980819  0.490055  0.174907
D  0.730961  0.345907  0.613273
E  0.973964  0.478535  0.701769

In [11]:
df[1]

A    0.260636
B    0.687484
C    0.980819
D    0.730961
E    0.973964
Name: 1, dtype: float64

In [16]:
print(df.loc['A'])
df.iloc[0]

1    0.260636
2    0.658642
3    0.533796
Name: A, dtype: float64

1    0.260636
2    0.658642
3    0.533796
Name: A, dtype: float64

In [19]:
booldf=df<0

In [21]:
df[booldf]

    1   2   3
A NaN NaN NaN
B NaN NaN NaN
C NaN NaN NaN
D NaN NaN NaN
E NaN NaN NaN

In [25]:
df[(df[1]<0)|(df[2]>0)]

          1         2         3
A  0.260636  0.658642  0.533796
B  0.687484  0.609643  0.107964
C  0.980819  0.490055  0.174907
D  0.730961  0.345907  0.613273
E  0.973964  0.478535  0.701769

In [26]:
df.reset_index()

  index         1         2         3
0     A  0.260636  0.658642  0.533796
1     B  0.687484  0.609643  0.107964
2     C  0.980819  0.490055  0.174907
3     D  0.730961  0.345907  0.613273
4     E  0.973964  0.478535  0.701769

In [28]:
newindex=['1',2,3,4,5]
df['states']=newindex
df

          1         2         3 states
A  0.260636  0.658642  0.533796      1
B  0.687484  0.609643  0.107964      2
C  0.980819  0.490055  0.174907      3
D  0.730961  0.345907  0.613273      4
E  0.973964  0.478535  0.701769      5

In [29]:
df.set_index('states')

               1         2         3
states
1       0.260636  0.658642  0.533796
2       0.687484  0.609643  0.107964
3       0.980819  0.490055  0.174907
4       0.730961  0.345907  0.613273
5       0.973964  0.478535  0.701769

In [58]:
lis1=[1,2,3,7,8,9]
lis2=[4,5,6,10,11,12]
my_lis=list(zip(lis1,lis2))
my_lis

[(1, 4), (2, 5), (3, 6), (7, 10), (8, 11), (9, 12)]

In [10]:
lis1=['a1','a1','a1','a7','a7','a7']
lis2=[4,5,6,10,11,12]
my_lis=list(zip(lis1,lis2))
my_lis=pd.MultiIndex.from_tuples(my_lis)
my_lis

MultiIndex(levels=[['a1', 'a7'], [4, 5, 6, 10, 11, 12]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 3, 4, 5]])

In [11]:
lis1=['a1','a1','a1','a7','a7','a7']
lis2=[4,5,6,4,5,6]
my_lis=list(zip(lis1,lis2))
my_lis=pd.MultiIndex.from_tuples(my_lis)
df=pd.DataFrame(np.random.randn(6,2),my_lis,['a','b'])

In [12]:
df

             a         b
a1 4 -0.611333  0.000313
   5 -0.350541 -0.187845
   6  1.343784  0.750478
a7 4 -1.150779  0.469022
   5 -0.179463 -1.276633
   6  0.895814 -1.418108

In [80]:
df.loc['a1']

          a         b
4 -0.402720 -1.220396
5 -2.170450  0.234820
6 -0.267752 -0.133196

In [84]:
df.index.names=['indexes','subindex']

In [87]:
df.xs(4,level='subindex')

                a         b
indexes
a1       0.614153 -0.921907
a7      -1.097110  0.171624

In [21]:
df1=pd.DataFrame({'a':[1,2],'b':[3,4]})
df1

   a  b
0  1  3
1  2  4

In [25]:
df2=pd.DataFrame({'a':[9,2],'b':[8,6]},index=[2,3])
df2

   a  b
2  9  8
3  2  6

In [27]:
pd.concat([df1,df2],axis=1)

     a    b    a    b
0  1.0  3.0  NaN  NaN
1  2.0  4.0  NaN  NaN
2  NaN  NaN  9.0  8.0
3  NaN  NaN  2.0  6.0

In [30]:
df1=pd.DataFrame({'a':[1,2],'b':[3,4],'c':[9,0]})
df1

   a  b  c
0  1  3  9
1  2  4  0

In [33]:
df2=pd.DataFrame({'a':[9,2],'b':[8,6],'c':[9,0]})
df2

   a  b  c
0  9  8  9
1  2  6  0

In [37]:
pd.merge(df1,df2,how='inner',on='c')

   a_x  b_x  c  a_y  b_y
0    1    3  9    9    8
1    2    4  0    2    6

In [39]:
df3=pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","July 26, 2017"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"

In [48]:
df3[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","July 26, 2017"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"
5,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017","May 18, 2017"
6,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017","May 18, 2017"
7,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,"January 13, 2017","May 18, 2017"
8,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","September 25, 2017"
9,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","June 1, 2017"
10,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
11,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
12,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","March 13, 2017"
13,Hometown National Bank,Longview,WA,35156,Twin City Bank,"October 2, 2015","February 19, 2018"
14,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,"October 2, 2015","October 24, 2016"
15,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb","July 10, 2015","February 20, 2018"
16,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,"May 8, 2015","July 12, 2016"
17,Doral Bank En Espanol,San Juan,PR,32102,Banco Popular de Puerto Rico,"February 27, 2015","May 13, 2015"
18,Capitol City Bank & Trust Company,Atlanta,GA,33938,First-Citizens Bank & Trust Company,"February 13, 2015","April 21, 2015"
19,Highland Community Bank,Chicago,IL,20290,"United Fidelity Bank, fsb","January 23, 2015","November 15, 2017"
20,First National Bank of Crestview,Crestview,FL,17557,First NBC Bank,"January 16, 2015","November 15, 2017"
21,Northern Star Bank,Mankato,MN,34983,BankVista,"December 19, 2014","January 3, 2018"
22,"Frontier Bank, FSB D/B/A El Paseo Bank",Palm Desert,CA,34738,"Bank of Southern California, N.A.","November 7, 2014","November 10, 2016"
23,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,"October 24, 2014","January 6, 2016"
24,NBRS Financial,Rising Sun,MD,4862,Howard Bank,"October 17, 2014","February 19, 2018"
25,"GreenChoice Bank, fsb",Chicago,IL,28462,"Providence Bank, LLC","July 25, 2014","December 12, 2016"
26,Eastside Commercial Bank,Conyers,GA,58125,Community & Southern Bank,"July 18, 2014","October 6, 2017"
27,The Freedom State Bank,Freedom,OK,12483,Alva State Bank & Trust Company,"June 27, 2014","February 21, 2018"
28,Valley Bank,Fort Lauderdale,FL,21793,"Landmark Bank, National Association","June 20, 2014","February 14, 2018"
29,Valley Bank,Moline,IL,10450,Great Southern Bank,"June 20, 2014","June 26, 2015"
...,...,...,...,...,...,...,...
525,"ANB Financial, NA",Bentonville,AR,33901,Pulaski Bank and Trust Company,"May 9, 2008","August 28, 2012"
526,Hume Bank,Hume,MO,1971,Security Bank,"March 7, 2008","August 28, 2012"
527,Douglass National Bank,Kansas City,MO,24660,Liberty Bank and Trust Company,"January 25, 2008","October 26, 2012"
528,Miami Valley Bank,Lakeview,OH,16848,The Citizens Banking Company,"October 4, 2007","September 12, 2016"
529,NetBank,Alpharetta,GA,32575,ING DIRECT,"September 28, 2007","August 28, 2012"
530,Metropolitan Savings Bank,Pittsburgh,PA,35353,Allegheny Valley Bank of Pittsburgh,"February 2, 2007","October 27, 2010"
531,Bank of Ephraim,Ephraim,UT,1249,Far West Bank,"June 25, 2004","April 9, 2008"
532,Reliance Bank,White Plains,NY,26778,Union State Bank,"March 19, 2004","April 9, 2008"
533,Guaranty National Bank of Tallahassee,Tallahassee,FL,26838,Hancock Bank of Florida,"March 12, 2004","June 5, 2012"
534,Dollar Savings Bank,Newark,NJ,31330,No Acquirer,"February 14, 2004","April 9, 2008"
535,Pulaski Savings Bank,Philadelphia,PA,27203,Earthstar Bank,"November 14, 2003","October 6, 2017"
536,First National Bank of Blanchardville,Blanchardville,WI,11639,The Park Bank,"May 9, 2003","June 5, 2012"
537,Southern Pacific Bank,Torrance,CA,27094,Beal Bank,"February 7, 2003","October 20, 2008"
538,Farmers Bank of Cheneyville,Cheneyville,LA,16445,Sabine State Bank & Trust,"December 17, 2002","October 20, 2004"
539,Bank of Alamo,Alamo,TN,9961,No Acquirer,"November 8, 2002","March 18, 2005"
540,AmTrade International Bank En Espanol,Atlanta,GA,33784,No Acquirer,"September 30, 2002","September 11, 2006"
541,Universal Federal Savings Bank,Chicago,IL,29355,Chicago Community Bank,"June 27, 2002","October 6, 2017"
542,Connecticut Bank of Commerce,Stamford,CT,19183,Hudson United Bank,"June 26, 2002","February 14, 2012"
543,New Century Bank,Shelby Township,MI,34979,No Acquirer,"March 28, 2002","March 18, 2005"
544,Net 1st National Bank,Boca Raton,FL,26652,Bank Leumi USA,"March 1, 2002","April 9, 2008"
545,"NextBank, NA",Phoenix,AZ,22314,No Acquirer,"February 7, 2002","February 5, 2015"
546,Oakwood Deposit Bank Co.,Oakwood,OH,8966,The State Bank & Trust Company,"February 1, 2002","October 25, 2012"
547,Bank of Sierra Blanca,Sierra Blanca,TX,22002,The Security State Bank of Pecos,"January 18, 2002","November 6, 2003"
548,"Hamilton Bank, NA En Espanol",Miami,FL,24382,Israel Discount Bank of New York,"January 11, 2002","September 21, 2015"
549,Sinclair National Bank,Gravette,AR,34248,Delta Trust & Bank,"September 7, 2001","October 6, 2017"
550,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
551,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
552,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
553,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
554,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [49]:
from sqlalchemy import create_engine

In [50]:
eng=create_engine('sqlite:///:memory:')

In [51]:
eng

Engine(sqlite:///:memory:)

In [52]:
df1

   a  b  c
0  1  3  9
1  2  4  0

In [53]:
pwd

'C:\\Users\\margam'

In [93]:
sal=pd.read_csv('Salaries.csv')

C:\Users\margam\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2698: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [56]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [57]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148049 non-null object
OvertimePay         148654 non-null object
OtherPay            148654 non-null object
Benefits            112495 non-null object
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              38119 non-null object
dtypes: float64(3), int64(2), object(8)
memory usage: 10.2+ MB

In [69]:
sal.head(5)['BasePay'].mean()

149686.78599999999

In [70]:
sal.head(5)['OvertimePay'].max()

245131.88

In [97]:
get=sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']
get

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [101]:
sal[sal['Year']==2011]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602,8601,189083,NaN,316285.74,316285.74,2011,NaN,San Francisco,NaN
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492,89062.9,134426,NaN,315981.05,315981.05,2011,NaN,San Francisco,NaN
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256577,0,51322.5,NaN,307899.46,307899.46,2011,NaN,San Francisco,NaN
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176933,86362.7,40132.2,NaN,303427.55,303427.55,2011,NaN,San Francisco,NaN
9,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262,0,17115.7,NaN,302377.73,302377.73,2011,NaN,San Francisco,NaN
10,11,ARTHUR KENNEY,"ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",194999,71344.9,33149.9,NaN,299494.17,299494.17,2011,NaN,San Francisco,NaN
11,12,PATRICIA JACKSON,CAPTAIN III (POLICE DEPARTMENT),99722,87082.6,110804,NaN,297608.92,297608.92,2011,NaN,San Francisco,NaN
12,13,EDWARD HARRINGTON,EXECUTIVE CONTRACT EMPLOYEE,294580,0,0,NaN,294580.02,294580.02,2011,NaN,San Francisco,NaN
13,14,JOHN MARTIN,DEPARTMENT HEAD V,271329,0,21342.6,NaN,292671.62,292671.62,2011,NaN,San Francisco,NaN
14,15,DAVID FRANKLIN,"BATTALION CHIEF, (FIRE DEPARTMENT)",174873,74050.3,37424.1,NaN,286347.05,286347.05,2011,NaN,San Francisco,NaN
15,16,RICHARD CORRIEA,"COMMANDER III, (POLICE DEPARTMENT)",198778,73478.2,13957.6,NaN,286213.86,286213.86,2011,NaN,San Francisco,NaN
16,17,AMY HART,DEPARTMENT HEAD V,268605,0,16115.9,NaN,284720.43,284720.43,2011,NaN,San Francisco,NaN
17,18,SEBASTIAN WONG,"CAPTAIN, EMERGENCYCY MEDICAL SERVICES",140547,119397,18625.1,NaN,278569.21,278569.21,2011,NaN,San Francisco,NaN
18,19,MARTY ROSS,"BATTALION CHIEF, (FIRE DEPARTMENT)",168693,69626.1,38115.5,NaN,276434.22,276434.22,2011,NaN,San Francisco,NaN
19,20,ELLEN MOFFATT,ASSISTANT MEDICAL EXAMINER,257511,880.16,16159.5,NaN,274550.25,274550.25,2011,NaN,San Francisco,NaN
20,21,VENUS AZAR,ASSISTANT MEDICAL EXAMINER,257510,0,16679.8,NaN,274190.27,274190.27,2011,NaN,San Francisco,NaN
21,22,JUDY MELINEK,ASSISTANT MEDICAL EXAMINER,257510,377.21,15883.6,NaN,273771.21,273771.21,2011,NaN,San Francisco,NaN
22,23,GEORGE GARCIA,"CAPTAIN, FIRE SUPPRESSION",140547,93200.6,39955.2,NaN,273702.71,273702.71,2011,NaN,San Francisco,NaN
23,24,VICTOR WYRSCH,"BATTALION CHIEF, (FIRE DEPARTMENT)",168693,77896.1,24083.9,NaN,270672.63,270672.63,2011,NaN,San Francisco,NaN
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140547,97868.8,31909.3,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN
25,26,GREGORY SUHR,CHIEF OF POLICE,256470,0,11522.2,NaN,267992.59,267992.59,2011,NaN,San Francisco,NaN
26,27,JOHN HANLEY,"CAPTAIN, FIRE SUPPRESSION",92080.8,40008,133696,NaN,265784.56,265784.56,2011,NaN,San Francisco,NaN
27,28,RAYMOND GUZMAN,"BATTALION CHIEF, (FIRE DEPARTMENT)",168693,80706.9,16064,NaN,265463.46,265463.46,2011,NaN,San Francisco,NaN
28,29,DENISE SCHMITT,DEPUTY CHIEF III (POLICE DEPARTMENT),261718,0,2357,NaN,264074.60,264074.60,2011,NaN,San Francisco,NaN
29,30,MONICA FIELDS,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",246226,0,15140.5,NaN,261366.14,261366.14,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
36129,36130,CAMPBELL ALEXANDER,RECREATION LEADER,33.75,0,0,NaN,33.75,33.75,2011,NaN,San Francisco,NaN
36130,36131,ANTONIO MORENO,RECREATION LEADER,33.75,0,0,NaN,33.75,33.75,2011,NaN,San Francisco,NaN
36131,36132,YU TING LI,RECREATION LEADER,33.75,0,0,NaN,33.75,33.75,2011,NaN,San Francisco,NaN
36132,36133,LAQUITA GRIFFITHS,TRANSIT OPERATOR,0,0,33.65,NaN,33.65,33.65,2011,NaN,San Francisco,NaN
36133,36134,ARIANA VELASCO,RECREATION LEADER,31.08,0,0,NaN,31.08,31.08,2011,NaN,San Francisco,NaN
36134,36135,DOMINIQUE HOSKINS,RECREATION LEADER,31.08,0,0,NaN,31.08,31.08,2011,NaN,San Francisco,NaN
36135,36136,CAROLINA CALDERON,PUBLIC SERVICE AIDE-ASSISTANT TO PROFESSIONALS,30.25,0,0,NaN,30.25,30.25,2011,NaN,San Francisco,NaN
36136,36137,SHIRLEY MOK,PUBLIC SERVICE AIDE-ASSISTANT TO PROFESSIONALS,30.25,0,0,NaN,30.25,30.25,2011,NaN,San Francisco,NaN
36137,36138,ALEX AMEND,RECREATION LEADER,29.25,0,0,NaN,29.25,29.25,2011,NaN,San Francisco,NaN
36138,36139,SEAN DOLAN,RECREATION LEADER,27.63,0,0,NaN,27.63,27.63,2011,NaN,San Francisco,NaN
36139,36140,KATHERINE BALESTRIERI,PUBLIC SERVICE TRAINEE,27.28,0,0,NaN,27.28,27.28,2011,NaN,San Francisco,NaN
36140,36141,TESS WILLIAMS,PUBLIC SERVICE TRAINEE,27.28,0,0,NaN,27.28,27.28,2011,NaN,San Francisco,NaN
36141,36142,AMELIA WILLIAMS,PUBLIC SERVICE TRAINEE,27.28,0,0,NaN,27.28,27.28,2011,NaN,San Francisco,NaN
36142,36143,PHOEBE LONGHI,PUBLIC SERVICE TRAINEE,27.28,0,0,NaN,27.28,27.28,2011,NaN,San Francisco,NaN
36143,36144,BLOSSOM WONG,PUBLIC SERVICE TRAINEE,27.28,0,0,NaN,27.28,27.28,2011,NaN,San Francisco,NaN
36144,36145,GRANGER BALESTRIERI,PUBLIC SERVICE TRAINEE,27.28,0,0,NaN,27.28,27.28,2011,NaN,San Francisco,NaN
36145,36146,ISAAC ZIMMERN,PUBLIC SERVICE TRAINEE,27.28,0,0,NaN,27.28,27.28,2011,NaN,San Francisco,NaN
36146,36147,SERENA YEE,PUBLIC SERVICE TRAINEE,27.28,0,0,NaN,27.28,27.28,2011,NaN,San Francisco,NaN
36147,36148,PAUL PELS,GARDENER,0,0,21.83,NaN,21.83,21.83,2011,NaN,San Francisco,NaN
36148,36149,GERALDINE DESPANIE,TRANSIT OPERATOR,0,0,20.37,NaN,20.37,20.37,2011,NaN,San Francisco,NaN
36149,36150,ANH LUU,CLERK,0,18.78,0,NaN,18.78,18.78,2011,NaN,San Francisco,NaN
36150,36151,WALTER WILLIAMS,LIBRARY PAGE,17.48,0,0.3,NaN,17.78,17.78,2011,NaN,San Francisco,NaN
36151,36152,MARVA MOORE,TRANSIT OPERATOR,0,0,17.42,NaN,17.42,17.42,2011,NaN,San Francisco,NaN
36152,36153,MARCELLA TUCKER,TRANSIT OPERATOR,0,0,8.86,NaN,8.86,8.86,2011,NaN,San Francisco,NaN
36153,36154,ROCK CRAWFORD,FIREFIGHTER,0,0,5.8,NaN,5.80,5.80,2011,NaN,San Francisco,NaN
36154,36155,SERENA HUGHES,SWIMMING INSTRUCTOR/POOL LIFEGUARD,0,0,4.17,NaN,4.17,4.17,2011,NaN,San Francisco,NaN
36155,36156,JOE BROWN JR,TRANSIT OPERATOR,0,0,0.3,NaN,0.30,0.30,2011,NaN,San Francisco,NaN
36156,36157,PAULETTE ADAMS,"STATIONARY ENGINEER, WATER TREATMENT PLANT",0,0,0,NaN,0.00,0.00,2011,NaN,San Francisco,NaN
36157,36158,KAUKAB MOHSIN,TRANSIT OPERATOR,0,0,0,NaN,0.00,0.00,2011,NaN,San Francisco,NaN
36158,36159,JOSEPHINE MCCREARY,MANAGER IV,0,0,0,NaN,0.00,0.00,2011,NaN,San Francisco,NaN

In [95]:
sal['EmployeeName']=
sal2

0                 NATHANIEL FORD
1                   GARY JIMENEZ
2                 ALBERT PARDINI
3              CHRISTOPHER CHONG
4                PATRICK GARDNER
5                 DAVID SULLIVAN
6                      ALSON LEE
7                  DAVID KUSHNER
8                 MICHAEL MORRIS
9             JOANNE HAYES-WHITE
10                 ARTHUR KENNEY
11              PATRICIA JACKSON
12             EDWARD HARRINGTON
13                   JOHN MARTIN
14                DAVID FRANKLIN
15               RICHARD CORRIEA
16                      AMY HART
17                SEBASTIAN WONG
18                    MARTY ROSS
19                 ELLEN MOFFATT
20                    VENUS AZAR
21                  JUDY MELINEK
22                 GEORGE GARCIA
23                 VICTOR WYRSCH
24               JOSEPH DRISCOLL
25                  GREGORY SUHR
26                   JOHN HANLEY
27                RAYMOND GUZMAN
28                DENISE SCHMITT
29                 MONICA FIELDS
                   ...
148624        Lorraine Rosenthal
148625           Renato C Gurion
148626             Paulet Gaines
148627          Brett A Lundberg
148628            Mark W Mcclure
148629         Elizabeth Iniguez
148630              Randy J Keys
148631           Andre M Johnson
148632    Sharon D Owens-Webster
148633          Edward Ferdinand
148634            David M Turner
148635       James S Kibblewhite
148636             Andrew J Enzi
148637          Kadeshra D Green
148638      Lennard B Hutchinson
148639         Richard A Talbert
148640        Charlene D Mccully
148641     Raphael Marquis Goins
148642         Dominic C Marquez
148643                Kim Brewer
148644              Randy D Winn
148645          Carolyn A Wilson
148646              Not provided
148647            Joann Anderson
148648               Leon Walker
148649             Roy I Tillery
148650              Not provided
148651              Not provided
148652              Not provided
148653                 Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object